//
//  ProportionImage.swift
//  YiDa
//
//  Created by cjjc on 2022/8/3.
//

import Foundation

//图片比例
class ProportionImage{
    /**--------------------------- 首页banner---------------------------*/
    static let img_scale_351_150 = 150/351.0
    
    /**--------------------------- 首页任务系统海报---------------------------*/
    static let img_scale_351_100 = 100/351.0
    
    /**---------------------------发现banner图---------------------------*/
    static let img_scale_315_138 = 138/315.0
    
    /**--------------------------- 发现列表banner图---------------------------*/
    static let img_scale_110_80 = 80/110.0
    
    /**--------------------------- 文章banner图--------------------------*/
    static let img_scale_351_197 = 197/351.0
}
